tutorials/heatTransfer/overBuoyantPimpleDyMFoam/movingBox/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            uniformFixedValue;
        uniformValue    uniform (0 0 0);
    }
    inlet
    {
        type            uniformFixedValue;
        uniformValue    uniform (0 0 0);
    }
    outlet
    {
        type            uniformFixedValue;
        uniformValue    uniform (0 0 0);
    }
    hole
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    frontAndBack1
    {
        type            empty;
    }
}


// ************************************************************************* //
